In [1]:
# Import dependencies
import pandas as pd

In [5]:
# Data loading
file_path = "./shopping_data.csv"
df_shopping = pd.read_csv(file_path, encoding="ISO-8859-1")
df_shopping.head(5)

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [10]:
# List dataframe data types
df_shopping.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [13]:
#Find null values
for column in df_shopping.columns:
    print(f"Column {column} has {df_shopping[column].isnull().sum()} null values")

Column CustomerID has 0 null values
Column Card Member has 2 null values
Column Age has 2 null values
Column Annual Income has 0 null values
Column Spending Score (1-100) has 1 null values

In [14]:
# Drop null values
df_shopping = df_shopping.dropna()

In [15]:
# Check dataframe for null values again
df_shopping[column].isnull().sum()

0

In [17]:
# Find duplicate values
print(f"Duplicate entries: {df_shopping.duplicated().sum()}")

Duplicate entries: 0

In [22]:
# Remove customer ID column from the datafram
new_df_shopping = df_shopping.drop(['CustomerID'], axis=1)
new_df_shopping.head(5)

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [23]:
# Transform String columns
def change_string(member):
    if member == "Yes":
        return 1
    else: 
        return 0
new_df_shopping["Card Member"] = new_df_shopping["Card Member"].apply(change_string)
new_df_shopping.head(5)

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [24]:
# Transform annual income column
new_df_shopping["Annual Income"] = new_df_shopping["Annual Income"]/1000
new_df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [26]:
# Reformat names of columns to have no space
new_df_shopping.rename(columns={"Card Member": "Card_Member", "Annual Income" : "Annual_Income", "Spending Score": "Spending_Score"})

     Card_Member   Age  Annual_Income  Spending Score (1-100)
0              1  19.0           15.0                    39.0
1              1  21.0           15.0                    81.0
2              0  20.0           16.0                     6.0
3              0  23.0           16.0                    77.0
4              0  31.0           17.0                    40.0
..           ...   ...            ...                     ...
198            0  35.0          120.0                    79.0
199            0  45.0          126.0                    28.0
200            1  32.0          126.0                    74.0
201            1  32.0          137.0                    18.0
202            1  30.0          137.0                    83.0

[200 rows x 4 columns]

In [27]:
# Saving the cleaned dataframe
output_file_path = "./shopping_data_cleaned.csv"
new_df_shopping.to_csv(output_file_path, index=False)